Revit 2024 API
AssetPropertyList Class
 Represents a list of AssetProperty(s).
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class AssetPropertyList : AssetProperty
Visual Basic
Public Class AssetPropertyList _
	Inherits AssetProperty
Visual C++
public ref class AssetPropertyList : public AssetProperty
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AssetProperty
 Autodesk.Revit.DB.Visual.AssetPropertyList
See Also
AssetPropertyList Members
Autodesk.Revit.DB.Visual Namespace